[
  {
    "title": "Keely Hodgkinson To Clash With Loaded Field In Lausanne",
    "date": "July 25, 2025",
    "content": "Keely Hodgkinson is set to face a formidable lineup at the Lausanne Diamond League meet, featuring strong competitors like Tsige Duguma and Georgia Hunter-Bell. The event promises to be a thrilling showdown as Hodgkinson aims to continue her impressive season. With multiple athletes boasting personal bests, fans can expect a fiercely competitive race. This clash is not only pivotal for Hodgkinson's career but also for the overall dynamics of middle-distance running.",
    "source": "FloTrack",
    "link": "https://www.flotrack.org/articles/14405733-keely-hodgkinson-tsige-duguma-and-georgia-hunter-bell-to-clash-in-lausanne",
    "id": "1"
  },
  {
    "title": "Grand Slam Track points fingers over mounting financial troubles",
    "date": "July 25, 2025",
    "content": "Grand Slam Track is facing significant financial difficulties, prompting officials to point fingers at various stakeholders for the crisis. The organization has struggled with sponsorships and operational costs, leading to concerns about its future. As the situation escalates, calls for accountability and strategic changes are growing louder within the running community. The article delves into the implications of these troubles on upcoming events and the broader athletic landscape.",
    "source": "Running Magazine",
    "link": "https://runningmagazine.ca/the-scene/grand-slam-track-points-fingers-over-mounting-financial-troubles/",
    "id": "2"
  },
  {
    "title": "AAU Junior Olympics Schedule 2025 On Saturday, July 26",
    "date": "July 25, 2025",
    "content": "The AAU Junior Olympics is set to kick off on Saturday, July 26, 2025, featuring a packed schedule of events for young athletes. This prestigious competition will showcase talent across various track and field disciplines, offering a platform for future stars to shine. Athletes from around the nation will gather to compete, fostering sportsmanship and camaraderie. Stay tuned for updates on the exciting performances and results throughout the event.",
    "source": "FloTrack",
    "link": "https://www.flotrack.org/articles/14406477-aau-junior-olympics-schedule-2025-on-saturday-july-26",
    "id": "3"
  },
  {
    "title": "Masai Russell Is Headed To Lausanne For 100mH Showdown",
    "date": "July 24, 2025",
    "content": "Masai Russell is set to compete in the highly anticipated 100m hurdles at the Lausanne Diamond League. Known for her explosive speed and technique, Russell aims to make a significant impact against a strong field of competitors. This showdown promises to showcase some of the best talent in the sport, as athletes vie for top positions in the Diamond League standings. Fans can expect an electrifying race as Russell looks to continue her impressive season.",
    "source": "FloTrack",
    "link": "https://www.flotrack.org/articles/14405141-masai-russell-is-headed-to-the-lausanne-diamond-league-for-100mh-showdown",
    "id": "4"
  },
  {
    "title": "Copenhagen Marathon champion suspended for use of EPO",
    "date": "July 24, 2025",
    "content": "The reigning champion of the Copenhagen Marathon has been suspended after testing positive for EPO, a banned performance-enhancing substance. This shocking development has raised questions about doping in the sport and the integrity of competitive running. The athlete, who had celebrated a remarkable victory, now faces potential sanctions and a tarnished reputation. The incident highlights ongoing challenges in anti-doping efforts within athletics.",
    "source": "Running Magazine",
    "link": "https://runningmagazine.ca/the-scene/copenhagen-marathon-champion-suspended-for-use-of-epo/",
    "id": "5"
  },
  {
    "title": "These AAU Stars Could Be The Future Of Track And Field",
    "date": "July 24, 2025",
    "content": "The article highlights several young athletes from the Amateur Athletic Union (AAU) who are making waves in the track and field world. These talented runners are expected to be future stars of the sport, with some already breaking records and showing impressive potential. The article provides insight into their backgrounds, training regimens, and goals for the future.",
    "source": "FloTrack",
    "link": "https://www.flotrack.org/articles/14405058-these-aau-stars-could-be-the-future-of-track-and-field",
    "id": "6"
  },
  {
    "title": "Julien Alfred Crushes 200m Field With 21.71 PB",
    "date": "July 23, 2025",
    "content": "Julien Alfred showcased her incredible speed by dominating the 200m race with a personal best of 21.71 seconds. This impressive performance not only solidifies her status as a top contender but also sets high expectations as she prepares for the upcoming Tokyo 2025 World Championships. Alfred's victory highlights her relentless training and determination, making her a standout athlete to watch in the lead-up to the event.",
    "source": "FloTrack",
    "link": "https://www.flotrack.org/articles/14403515-julien-alfred-crushes-200m-field-with-2171-pb-ahead-of-tokyo-2025-worlds",
    "id": "7"
  },
  {
    "title": "AAU Junior Olympics 2025 Schedule: What To Know",
    "date": "July 23, 2025",
    "content": "The AAU Junior Olympics is set to return in 2025, bringing together young athletes from across the nation to compete at the highest level. This year's event promises an exciting schedule filled with various track and field events, showcasing the talent and determination of future stars. Athletes and coaches are encouraged to prepare early, as registration details and specific event dates will be announced soon. Stay tuned for updates to ensure you don't miss out on this prestigious competition.",
    "source": "FloTrack",
    "link": "https://www.flotrack.org/articles/14403721-aau-junior-olympics-2025-schedule-what-to-know",
    "id": "8"
  },
  {
    "title": "2025 Wanda Diamond League Standings, Who Is Leading?",
    "date": "July 22, 2025",
    "content": "As the 2025 Wanda Diamond League season progresses, the competition heats up with standout performances from elite athletes. Current leaders in various events are showcasing their skills, vying for top positions in the overall standings. With several meets left in the season, fans are eager to see if any emerging talents can disrupt the frontrunners. Stay tuned as the race for the championship intensifies!",
    "source": "FloTrack",
    "link": "https://www.flotrack.org/articles/14185884-2025-wanda-diamond-league-standings-who-is-leading",
    "id": "9"
  },
  {
    "title": "London Diamond League Results 2025: Charlie Dobson, Oblique Seville & More",
    "date": "July 20, 2025",
    "content": "The London Diamond League showcased thrilling performances, with Charlie Dobson and Oblique Seville stealing the spotlight. Dobson clinched victory in the men's 400m, while Seville impressed in the 200m with a personal best. The event also featured strong showings from other top athletes, highlighting the competitive spirit ahead of the upcoming World Championships. Fans were treated to a day of record-breaking runs and exhilarating finishes.",
    "source": "FloTrack",
    "link": "https://www.flotrack.org/articles/14400626-london-diamond-league-results-2025-charlie-dobson-oblique-seville-more",
    "id": "6"
  },
  {
    "title": "London DL is Saturday",
    "date": "July 19, 2025",
    "content": "The highly anticipated London Diamond League event is set to take place this Saturday, featuring top athletes from around the world. Fans can expect thrilling races in various track and field disciplines, showcasing both emerging talents and seasoned champions. With perfect weather conditions predicted, the stage is set for record-breaking performances. Don't miss the excitement as the world's best compete at this iconic venue.",
    "source": "LetsRun",
    "link": "https://www.letsrun.com/events/2025/07/2025-novuna-london-athletics-meet-london-diamond-league",
    "id": "7"
  },
  {
    "title": "Watch Diamond League London Stream Free With The Athlete's",
    "date": "July 18, 2025",
    "content": "Fans can catch the exciting Diamond League London event for free through The Athlete's Lounge broadcast. This unique streaming opportunity allows viewers to experience the races from the perspective of the athletes themselves, providing insights and commentary that enhance the viewing experience. Don't miss out on the chance to see top runners compete at one of the premier events in the athletics calendar.",
    "source": "FloTrack",
    "link": "https://www.flotrack.org/articles/14394507-watch-diamond-league-london-stream-free-with-the-athletes-lounge-broadcast",
    "id": "8"
  },
  {
    "title": "Donavan Brazier Ready To Challenge On World Stage Again",
    "date": "July 18, 2025",
    "content": "After a two-year hiatus, Donavan Brazier is set to return to the Diamond League stage at the Stockholm Distance Meeting. The American middle-distance runner has been training hard and is eager to make his mark on the global running community once again.",
    "source": "FloTrack",
    "link": "https://www.flotrack.org/articles/14394503-donavan-brazier-headed-to-his-first-diamond-league-meet-since-2019",
    "id": "9"
  },
  {
    "title": "Marathon world record holder Ruth Chepngetich suspended for doping",
    "date": "July 17, 2025",
    "content": "Ruth Chepngetich, the reigning marathon world record holder, has been provisionally suspended due to a doping violation. The suspension follows an investigation that revealed the presence of banned substances in her system. This shocking news has sent ripples through the running community, as Chepngetich was celebrated for her remarkable achievements. The case highlights ongoing concerns about doping in athletics and the need for stringent enforcement of anti-doping regulations.",
    "source": "Running Magazine",
    "link": "https://runningmagazine.ca/the-scene/marathon-world-record-holder-ruth-chepngetich-gets-provisional-doping-suspension/",
    "id": "6"
  },
  {
    "title": "TCS Toronto Waterfront Marathon unveils 2025 race medal",
    "date": "July 17, 2025",
    "content": "The TCS Toronto Waterfront Marathon has revealed its medal design for the 2025 race, showcasing a vibrant and unique aesthetic that celebrates the spirit of the city. This year's medal features iconic landmarks and a modern twist, appealing to both participants and collectors. Organizers aim to enhance the runner experience, making the medal not just a reward but a cherished memento. With anticipation building for the event, runners are encouraged to register early to secure their spot.",
    "source": "Running Magazine",
    "link": "https://runningmagazine.ca/sections/runs-races/tcs-toronto-waterfront-marathon-unveils-2025-race-medal/",
    "id": "7"
  },
  {
    "title": "Noah Lyles Runs 100m Season Debut at the London DL: Full Meet Preview",
    "date": "July 17, 2025",
    "content": "Noah Lyles is set to make his highly anticipated 100m season debut at the London Diamond League. Fans are eager to see how the reigning world champion will perform as he takes on a competitive field. The meet promises thrilling races and showcases top athletes from around the globe, making it a must-watch event for track and field enthusiasts. Lyles aims to establish his dominance early in the season.",
    "source": "FloTrack",
    "link": "https://www.flotrack.org/articles/14388159-noah-lyles-runs-100m-season-debut-at-the-london-dl-full-meet-preview",
    "id": "8"
  },
  {
    "title": "Coldplay couple depicted in hilarious Strava art",
    "date": "October 23, 2023",
    "content": "In a creative twist, a couple used their running routes to create a playful depiction of the iconic Coldplay album cover. Utilizing the Strava app, they mapped out their runs to form a visual tribute that has gone viral among running and music fans alike. The project showcases the fun side of fitness, blending art and exercise in a unique way. Their Strava art not only highlights their love for Coldplay but also inspires others to explore creative expressions through their running activities.",
    "source": "Running Magazine",
    "link": "https://runningmagazine.ca/the-scene/coldplay-couple-depicted-in-hilarious-strava-art/",
    "id": "9"
  },
  {
    "title": "Sinclaire Johnson Sets The American Record In The Mile",
    "date": "October 22, 2023",
    "content": "Sinclaire Johnson has made history by setting a new American record in the mile, clocking an impressive time that has stunned fans and competitors alike. Her remarkable performance showcases her incredible talent and determination, solidifying her status as one of the top middle-distance runners in the country. This achievement not only highlights Johnson's hard work and dedication but also marks a significant milestone in American track and field. Fans are eager to see what she will accomplish next in her athletic career.",
    "source": "FloTrack",
    "link": "https://www.flotrack.org/articles/14401068-sinclaire-johnson-sets-the-american-record-in-the-mile",
    "id": "10"
  }
]