[
  {
    "title": "Donavan Brazier Ready To Challenge On World Stage Again",
    "date": "July 18, 2025",
    "content": "Donavan Brazier is set to make his highly anticipated return to the Diamond League, marking his first appearance since 2019. The former world champion is eager to showcase his skills against elite competition, following a challenging period of injuries and setbacks. With renewed determination and a strong training regimen, Brazier aims to reclaim his place among the world's best middle-distance runners. Fans are excited to see if he can translate his hard work into a standout performance on the global stage.",
    "source": "FloTrack",
    "link": "https://www.flotrack.org/articles/14394503-donavan-brazier-headed-to-his-first-diamond-league-meet-since-2019",
    "id": "1"
  },
  {
    "title": "Noah Lyles Eyes London Glory in 100m Showdown",
    "date": "July 18, 2025",
    "content": "Noah Lyles is gearing up for an electrifying 100m race in London, where he aims to assert his dominance on the track. Known for his explosive speed and competitive spirit, Lyles is focused on securing victory against a strong field of contenders. With his sights set on breaking personal records and claiming the title, fans can expect a thrilling showdown. Lyles' preparation and confidence suggest he is ready to make a significant mark in this prestigious event.",
    "source": "FloTrack",
    "link": "https://www.flotrack.org/articles/14393274-noah-lyles-eyes-london-glory-in-100m-showdown",
    "id": "2"
  },
  {
    "title": "2025 Wanda Diamond League Standings, Who Is Leading?",
    "date": "July 17, 2025",
    "content": "As the 2025 Wanda Diamond League season progresses, athletes are fiercely competing for top rankings. Notable performances have emerged, with several stars showcasing their talents and vying for the coveted diamond trophies. The standings are shaping up with a mix of seasoned veterans and rising newcomers. Fans are eagerly watching to see who will maintain their lead as the season approaches its climax.",
    "source": "FloTrack",
    "link": "https://www.flotrack.org/articles/14185884-2025-wanda-diamond-league-standings-who-is-leading",
    "id": "3"
  },
  {
    "title": "Marathon world record holder Ruth Chepngetich suspended for doping",
    "date": "July 17, 2025",
    "content": "Ruth Chepngetich, the reigning marathon world record holder, has been provisionally suspended due to a doping violation. The suspension follows an investigation that revealed the presence of banned substances in her system. This shocking news has sent ripples through the running community, as Chepngetich was celebrated for her remarkable achievements. The case highlights ongoing concerns about doping in athletics and the need for stringent enforcement of anti-doping regulations.",
    "source": "Running Magazine",
    "link": "https://runningmagazine.ca/the-scene/marathon-world-record-holder-ruth-chepngetich-gets-provisional-doping-suspension/",
    "id": "4"
  },
  {
    "title": "TCS Toronto Waterfront Marathon unveils 2025 race medal",
    "date": "July 17, 2025",
    "content": "The TCS Toronto Waterfront Marathon has revealed its medal design for the 2025 race, showcasing a vibrant and unique aesthetic that celebrates the spirit of the city. This year's medal features iconic landmarks and a modern twist, appealing to both participants and collectors. Organizers aim to enhance the runner experience, making the medal not just a reward but a cherished memento. With anticipation building for the event, runners are encouraged to register early to secure their spot.",
    "source": "Running Magazine",
    "link": "https://runningmagazine.ca/sections/runs-races/tcs-toronto-waterfront-marathon-unveils-2025-race-medal/",
    "id": "5"
  },
  {
    "title": "Noah Lyles Runs 100m Season Debut at the London DL: Full Meet Preview",
    "date": "July 17, 2025",
    "content": "Noah Lyles is set to make his highly anticipated 100m season debut at the London Diamond League. Fans are eager to see how the reigning world champion will perform as he takes on a competitive field. The meet promises thrilling races and showcases top athletes from around the globe, making it a must-watch event for track and field enthusiasts. Lyles aims to establish his dominance early in the season.",
    "source": "FloTrack",
    "link": "https://www.flotrack.org/articles/14388159-noah-lyles-runs-100m-season-debut-at-the-london-dl-full-meet-preview",
    "id": "6"
  },
  {
    "title": "SHOE REVIEW: Keen’s new Seek trail-running shoe",
    "date": "October 17, 2023",
    "content": "Keen has introduced its latest trail-running shoe, the Seek, designed for both comfort and performance on rugged terrains. Featuring a lightweight construction and enhanced traction, the Seek aims to provide runners with stability on uneven surfaces. The shoe incorporates eco-friendly materials, aligning with Keen's commitment to sustainability. Overall, the Seek is positioned as a versatile option for trail enthusiasts looking to elevate their running experience.",
    "source": "Running Magazine",
    "link": "https://runningmagazine.ca/trail-running/shoe-review-keens-new-seek-trail-running-shoe/",
    "id": "7"
  }
]