[
  {
    "title": "Noah Lyles Eyes London Glory in 100m Showdown",
    "date": "July 18, 2025",
    "content": "Noah Lyles is set to face off against the world's top sprinters at the London Anniversary Games, where he aims to cement his status as one of the sport's rising stars. With a personal best time of 9.46 seconds in the 100m dash, Lyles is confident in his ability to take home the gold medal and solidify his position at the top of the podium. Can he deliver on his promise and bring home the victory for Team USA?",
    "source": "FloTrack",
    "link": "https://www.flotrack.org/articles/14393274-noah-lyles-eyes-london-glory-in-100m-showdown",
    "id": "6"
  },
  {
    "title": "Donavan Brazier Ready To Challenge On World Stage Again",
    "date": "July 18, 2025",
    "content": "After a two-year hiatus, Donavan Brazier is set to return to the Diamond League stage at the Stockholm Distance Meeting. The American middle-distance runner has been training hard and is eager to make his mark on the global running community once again.",
    "source": "FloTrack",
    "link": "https://www.flotrack.org/articles/14394503-donavan-brazier-headed-to-his-first-diamond-league-meet-since-2019",
    "id": "5"
  },
  {
    "title": "2025 Wanda Diamond League Standings, Who Is Leading?",
    "date": "July 17, 2025",
    "content": "As the 2025 Wanda Diamond League season progresses, athletes are fiercely competing for top rankings. Notable performances have emerged, with several stars showcasing their talents and vying for the coveted diamond trophies. The standings are shaping up with a mix of seasoned veterans and rising newcomers. Fans are eagerly watching to see who will maintain their lead as the season approaches its climax.",
    "source": "FloTrack",
    "link": "https://www.flotrack.org/articles/14185884-2025-wanda-diamond-league-standings-who-is-leading",
    "id": "3"
  },
  {
    "title": "Marathon world record holder Ruth Chepngetich suspended for doping",
    "date": "July 17, 2025",
    "content": "Ruth Chepngetich, the reigning marathon world record holder, has been provisionally suspended due to a doping violation. The suspension follows an investigation that revealed the presence of banned substances in her system. This shocking news has sent ripples through the running community, as Chepngetich was celebrated for her remarkable achievements. The case highlights ongoing concerns about doping in athletics and the need for stringent enforcement of anti-doping regulations.",
    "source": "Running Magazine",
    "link": "https://runningmagazine.ca/the-scene/marathon-world-record-holder-ruth-chepngetich-gets-provisional-doping-suspension/",
    "id": "4"
  },
  {
    "title": "TCS Toronto Waterfront Marathon unveils 2025 race medal",
    "date": "July 17, 2025",
    "content": "The TCS Toronto Waterfront Marathon has revealed its medal design for the 2025 race, showcasing a vibrant and unique aesthetic that celebrates the spirit of the city. This year's medal features iconic landmarks and a modern twist, appealing to both participants and collectors. Organizers aim to enhance the runner experience, making the medal not just a reward but a cherished memento. With anticipation building for the event, runners are encouraged to register early to secure their spot.",
    "source": "Running Magazine",
    "link": "https://runningmagazine.ca/sections/runs-races/tcs-toronto-waterfront-marathon-unveils-2025-race-medal/",
    "id": "5"
  },
  {
    "title": "Noah Lyles Runs 100m Season Debut at the London DL: Full Meet Preview",
    "date": "July 17, 2025",
    "content": "Noah Lyles is set to make his highly anticipated 100m season debut at the London Diamond League. Fans are eager to see how the reigning world champion will perform as he takes on a competitive field. The meet promises thrilling races and showcases top athletes from around the globe, making it a must-watch event for track and field enthusiasts. Lyles aims to establish his dominance early in the season.",
    "source": "FloTrack",
    "link": "https://www.flotrack.org/articles/14388159-noah-lyles-runs-100m-season-debut-at-the-london-dl-full-meet-preview",
    "id": "6"
  }
]