[
  {
    "title": "2025 Wanda Diamond League Standings, Who Is Leading?",
    "date": "July 16, 2025",
    "content": "The 2025 Wanda Diamond League standings are heating up as the season enters its final stretch. With just a few races left before the championship event, athletes are fighting for position in the standings. Currently, Ethiopian distance runner, Letesenbet Gidey, is leading the pack with 125 points, followed closely by Kenyan sprinter, Ferdinand Omanyala, who has 105 points. Other top contenders include American middle-distance runner, Clayton Murphy, and Jamaican sprinter, Elaine Thompson.",
    "source": "FloTrack",
    "link": "https://www.flotrack.org/articles/14185884-2025-wanda-diamond-league-standings-who-is-leading",
    "imageUrl": "https://images.unsplash.com/photo-1571019613454-1cb2f99b2d8b?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1000&q=80",
    "id": "7"
  },
  {
    "title": "New Lazarus Lake book goes deep on the Barkley Marathons and Big's Backyard Ultra",
    "date": "July 16, 2025",
    "content": "Get ready for a deep dive into two of the most challenging ultrarunning events in the world. The new Lazarus Lake book takes an in-depth look at the Barkley Marathons and Big’s Backyard Ultra, providing insights and stories from some of the sport's top athletes. Whether you're a seasoned runner or just starting out, this book is sure to inspire and educate.",
    "source": "Running Magazine",
    "link": "https://runningmagazine.ca/trail-running/new-lazarus-lake-book-goes-deep-on-the-barkley-marathons-and-bigs-backyard-ultra/",
    "id": "6"
  },
  {
    "title": "Want to Break an Ultrarunning Champion? Send Her to Bhutan.",
    "date": "July 16, 2025",
    "content": "Clare Gallagher, a top ultrarunner, was recently pushed to her limits at the Snowman Race in Bhutan. Despite her impressive resume and reputation, she cracked under the pressure of the race's grueling terrain and extreme altitude. The experience has left her reevaluating her approach to racing and training.",
    "source": "Trail Runner Magazine",
    "link": "https://www.trailrunnermag.com/people/news/clare-gallagher-cracked-at-snowman-race/",
    "id": "5"
  },
  {
    "title": "Canada’s air quality is in crisis–your run can wait",
    "date": "July 16, 2025",
    "content": "A new report reveals that Canada's air quality is in crisis, with dangerous levels of pollution in many cities. The report suggests that runners and other outdoor enthusiasts should be aware of the risks and take necessary precautions to protect their health.",
    "source": "Running Magazine",
    "link": "https://runningmagazine.ca/the-scene/canadas-air-quality-is-in-crisis-your-run-can-wait/",
    "id": "3"
  }
]