[
  {
    "title": "How To Watch AAU Junior Olympics Track Field Meet 2025",
    "date": "July 26, 2025",
    "content": "The AAU Junior Olympics Track and Field Meet is set to showcase the future stars of athletics in 2025. Fans can catch all the action live through various streaming platforms, ensuring they don’t miss any of the thrilling performances. The event promises to be a highlight of the summer, featuring young athletes from across the nation competing for top honors. Stay tuned for detailed viewing options and schedules as the event approaches.",
    "source": "FloTrack",
    "link": "https://www.flotrack.org/articles/14389363-how-to-watch-aau-junior-olympics-track-field-meet-2025",
    "id": "1"
  },
  {
    "title": "AAU Junior Olympics Future Dates And Locations: Here's What To Know",
    "date": "July 26, 2025",
    "content": "The AAU Junior Olympics has announced its future dates and locations, ensuring young athletes can plan ahead for this prestigious event. The competition, known for showcasing emerging talent in track and field, will be held annually, with various cities across the U.S. hosting the games. Athletes and families are encouraged to stay informed about registration dates and venue specifics to make the most of this opportunity. This event continues to be a significant milestone for youth athletes aspiring to compete at higher levels.",
    "source": "FloTrack",
    "link": "https://www.flotrack.org/articles/14403728-aau-junior-olympics-future-dates-and-locations-heres-what-to-know",
    "id": "2"
  },
  {
    "title": "Keely Hodgkinson To Clash With Loaded Field In Lausanne",
    "date": "July 25, 2025",
    "content": "Keely Hodgkinson is set to face a formidable lineup at the Lausanne Diamond League meet, featuring strong competitors like Tsige Duguma and Georgia Hunter-Bell. The event promises to be a thrilling showdown as Hodgkinson aims to continue her impressive season. With multiple athletes boasting personal bests, fans can expect a fiercely competitive race. This clash is not only pivotal for Hodgkinson's career but also for the overall dynamics of middle-distance running.",
    "source": "FloTrack",
    "link": "https://www.flotrack.org/articles/14405733-keely-hodgkinson-tsige-duguma-and-georgia-hunter-bell-to-clash-in-lausanne",
    "id": "3"
  },
  {
    "title": "Grand Slam Track points fingers over mounting financial troubles",
    "date": "July 25, 2025",
    "content": "Grand Slam Track is facing significant financial difficulties, prompting officials to point fingers at various stakeholders for the crisis. The organization has struggled with sponsorships and operational costs, leading to concerns about its future. As the situation escalates, calls for accountability and strategic changes are growing louder within the running community. The article delves into the implications of these troubles on upcoming events and the broader athletic landscape.",
    "source": "Running Magazine",
    "link": "https://runningmagazine.ca/the-scene/grand-slam-track-points-fingers-over-mounting-financial-troubles/",
    "id": "4"
  },
  {
    "title": "AAU Junior Olympics Schedule 2025 On Saturday, July 26",
    "date": "July 25, 2025",
    "content": "The AAU Junior Olympics is set to kick off on Saturday, July 26, 2025, featuring a packed schedule of events for young athletes. This prestigious competition will showcase talent across various track and field disciplines, offering a platform for future stars to shine. Athletes from around the nation will gather to compete, fostering sportsmanship and camaraderie. Stay tuned for updates on the exciting performances and results throughout the event.",
    "source": "FloTrack",
    "link": "https://www.flotrack.org/articles/14406477-aau-junior-olympics-schedule-2025-on-saturday-july-26",
    "id": "5"
  },
  {
    "title": "Masai Russell Is Headed To Lausanne For 100mH Showdown",
    "date": "July 24, 2025",
    "content": "Masai Russell is set to compete in the highly anticipated 100m hurdles at the Lausanne Diamond League. Known for her explosive speed and technique, Russell aims to make a significant impact against a strong field of competitors. This showdown promises to showcase some of the best talent in the sport, as athletes vie for top positions in the Diamond League standings. Fans can expect an electrifying race as Russell looks to continue her impressive season.",
    "source": "FloTrack",
    "link": "https://www.flotrack.org/articles/14405141-masai-russell-is-headed-to-the-lausanne-diamond-league-for-100mh-showdown",
    "id": "6"
  },
  {
    "title": "Copenhagen Marathon champion suspended for use of EPO",
    "date": "July 24, 2025",
    "content": "The reigning champion of the Copenhagen Marathon has been suspended after testing positive for EPO, a banned performance-enhancing substance. This shocking development has raised questions about doping in the sport and the integrity of competitive running. The athlete, who had celebrated a remarkable victory, now faces potential sanctions and a tarnished reputation. The incident highlights ongoing challenges in anti-doping efforts within athletics.",
    "source": "Running Magazine",
    "link": "https://runningmagazine.ca/the-scene/copenhagen-marathon-champion-suspended-for-use-of-epo/",
    "id": "7"
  },
  {
    "title": "These AAU Stars Could Be The Future Of Track And Field",
    "date": "July 24, 2025",
    "content": "The article highlights several young athletes from the Amateur Athletic Union (AAU) who are making waves in the track and field world. These talented runners are expected to be future stars of the sport, with some already breaking records and showing impressive potential. The article provides insight into their backgrounds, training regimens, and goals for the future.",
    "source": "FloTrack",
    "link": "https://www.flotrack.org/articles/14405058-these-aau-stars-could-be-the-future-of-track-and-field",
    "id": "8"
  },
  {
    "title": "Julien Alfred Crushes 200m Field With 21.71 PB",
    "date": "July 23, 2025",
    "content": "Julien Alfred showcased her incredible speed by dominating the 200m race with a personal best of 21.71 seconds. This impressive performance not only solidifies her status as a top contender but also sets high expectations as she prepares for the upcoming Tokyo 2025 World Championships. Alfred's victory highlights her relentless training and determination, making her a standout athlete to watch in the lead-up to the event.",
    "source": "FloTrack",
    "link": "https://www.flotrack.org/articles/14403515-julien-alfred-crushes-200m-field-with-2171-pb-ahead-of-tokyo-2025-worlds",
    "id": "9"
  },
  {
    "title": "AAU Junior Olympics 2025 Schedule: What To Know",
    "date": "July 23, 2025",
    "content": "The AAU Junior Olympics is set to return in 2025, bringing together young athletes from across the nation to compete at the highest level. This year's event promises an exciting schedule filled with various track and field events, showcasing the talent and determination of future stars. Athletes and coaches are encouraged to prepare early, as registration details and specific event dates will be announced soon. Stay tuned for updates to ensure you don't miss out on this prestigious competition.",
    "source": "FloTrack",
    "link": "https://www.flotrack.org/articles/14403721-aau-junior-olympics-2025-schedule-what-to-know",
    "id": "10"
  }
]