[
  {
    "title": "2025 Wanda Diamond League Standings, Who Is Leading?",
    "date": "July 16, 2025",
    "content": "As the 2025 Wanda Diamond League progresses, athletes are fiercely competing for top rankings. Currently, a few standout performers are dominating the standings, showcasing their exceptional skills and consistency. The competition is heating up as the season approaches its climax, with several key events on the horizon that could shift the leaderboard significantly. Fans and analysts alike are eagerly watching to see who will emerge as the ultimate champion this year.",
    "source": "FloTrack",
    "link": "https://www.flotrack.org/articles/14185884-2025-wanda-diamond-league-standings-who-is-leading",
    "id": "1"
  },
  {
    "title": "Grand Slam Track faces unpaid rental fee from Miami event",
    "date": "July 16, 2025",
    "content": "Grand Slam Track is currently embroiled in a financial dispute over an unpaid rental fee linked to a recent event in Miami. The situation has raised concerns about the financial management of the event and its implications for future races. Organizers are under pressure to resolve the matter swiftly to maintain their reputation and ensure the continuation of their events. Stakeholders are watching closely as the outcome could influence future partnerships and event planning.",
    "source": "Running Magazine",
    "link": "https://runningmagazine.ca/the-scene/grand-slam-track-faces-unpaid-rental-fee-from-miami-event/",
    "id": "2"
  },
  {
    "title": "Sifan Hassan Goes from Marathon to Mile at the London DL: Full Meet Preview",
    "date": "July 16, 2025",
    "content": "Sifan Hassan is set to make a dramatic shift from marathon to mile racing at the London Diamond League. The two-time Olympic champion is looking to showcase her versatility and speed in this shorter distance after her recent marathon success. The meet promises to feature a stacked field, making it a must-watch event for track and field fans. As Hassan aims to break records, all eyes will be on her performance in this thrilling transition.",
    "source": "FloTrack",
    "link": "https://www.flotrack.org/articles/14388159-sifan-hassan-goes-from-marathon-to-mile-at-the-london-dl-full-meet-preview",
    "id": "3"
  }
]
